// Copyright 2023 QMK
// SPDX-License-Identifier: GPL-2.0-or-later

#include QMK_KEYBOARD_H

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
    /*
     *       ┌─────┬─────┬─────┬─────┬─────┬─────┐
     *       │  6  │  7  │  8  │  9  │  0  │ <-- │
     *       ├─────┼─────┼─────┼─────┼─────┼─────┤
     *       │  Y  │  U  │  I  │  O  │  P  │  ]  │
     * ┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │  H  │  J  │  K  │  L  │  ;  │  '  │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │ SFT │  N  │  M  │  ,  │  .  │  /  | Ent │
     * ├─────┼─────┼─────┼─────┴─────┴─────┴─────┘
     * | SUP | ^ 1 | END |
     * └─────┴─────┴─────┘
     */
    [0] = LAYOUT(
        KC_6,    KC_7,    KC_8,     KC_9,     KC_0,      KC_BSPC,
        KC_Y,    KC_U,    KC_I,     KC_O,     KC_P,      KC_RBRC,
        KC_H,    KC_J,    KC_K,     KC_L,     KC_SCLN,   KC_QUOT,
        KC_N,    KC_M,    KC_COMM,  KC_DOT,   KC_SLSH,   KC_ENT,
        KC_RSFT, KC_RGUI, MO(1),    KC_END
    )
    /* LAYER 1
     *       ┌─────┬─────┬─────┬─────┬─────┬─────┐
     *       │  F7 │  F8 │  F9 │ F10 │ F11 │ F12 │
     *       ├─────┼─────┼─────┼─────┼─────┼─────┤
     *       │ KP1 │ KP2 │ KP3 │ KP/ │ KP* │     │
     * ┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │ KP4 │ KP5 │ KP6 │ KP0 │ KP. │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │ KP7 │ KP8 │ KP9 │ KP- │ KP+ |KPENT│
     * ├─────┼─────┼─────┼─────┴─────┴─────┴─────┘
     * |     |     |     |
     * └─────┴─────┴─────┘
     */
    [1] = LAYOUT(
        KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12,
        KC_P1,   KC_P2,   KC_P3,   KC_PSLS, KC_PAST, KC_TRNS,
        KC_P4,   KC_P5,   KC_P6,   KC_P0,   KC_PDOT, KC_TRNS,
        KC_P7,   KC_P8,   KC_P9,   KC_PMNS, KC_PPLS, KC_PENT,
        KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS
    )
};

#if defined(ENCODER_MAP_ENBALE)
const uint16_t PROGMEM encoder_map[][NUM_ENCODERS][NUM_DIRECTIONS] = {
    [0] = {ENCODER_CCW_CW(MS_WHLU, MS_WHLD)}
}
#endif